[{"user":"U0HUU655Y","type":"message","subtype":"channel_join","text":"<@U0HUU655Y|levko> has joined the channel","ts":"1452376633.000002"},{"user":"U0HUU655Y","purpose":"Let’s brainstorm some project ideas here!","type":"message","subtype":"channel_purpose","text":"<@U0HUU655Y|levko> set the channel purpose: Let’s brainstorm some project ideas here!","ts":"1452376633.000003"},{"user":"U0J3A5RML","inviter":"U0HUU655Y","type":"message","subtype":"channel_join","text":"<@U0J3A5RML|nloewen> has joined the channel","ts":"1452376633.000004"},{"user":"U0HV1T7F1","inviter":"U0HUU655Y","type":"message","subtype":"channel_join","text":"<@U0HV1T7F1|yuriy> has joined the channel","ts":"1452376633.000005"},{"user":"U0J3D11K5","inviter":"U0HUU655Y","type":"message","subtype":"channel_join","text":"<@U0J3D11K5|sandersjess> has joined the channel","ts":"1452376633.000006"},{"user":"U0HV4EBMJ","inviter":"U0HUU655Y","type":"message","subtype":"channel_join","text":"<@U0HV4EBMJ|tboswick> has joined the channel","ts":"1452376633.000007"},{"type":"message","user":"U0HUU655Y","text":"I’ve been looking online for this stuff, and I found this book: <http:\/\/www.comp.nus.edu.sg\/~damithch\/guide3e\/>\n\nEssentially, it is a list of tips for handling software projects in university environment. Perhaps you would find it useful … don’t know :simple_smile:\n\nIf you have any ideas or suggestions, write them here. Also, it would be good to meet up after the Tuesday lecture to get the project title and the idea finalized so we can start thinking on how to implement it all...","edited":{"user":"U0HUU655Y","ts":"1452376988.000000"},"ts":"1452376835.000008"},{"type":"message","user":"U0J3D11K5","text":"I have an idea but not sure how easy it'll be to implement. I thought we could do some sort of downtown parking app. So based on your location or destination it could find the closet surface lot or parkade and check if there are any available spots. If not, it would give you the next closet available one ","ts":"1452379796.000010"},{"type":"message","user":"U0J3D11K5","text":"You could check the availability either through the time expirations and the known amount of lots of some even have attendants who could keep track of a more accurate number ","ts":"1452379855.000011"},{"type":"message","user":"U0HUU655Y","text":"Implementation-vise: this idea is easy. However, it is very data-driven project. First, we need a large dataset of parking spots for it to be useable. Secondly, we want to somehow get the parking spots count … \n\nhm, I am just thinking how we would manage the parking data in terms of how many spots are available. I guess once a user parks, we can ask for an estimate on how many spots are available around the user. Since people do tend to park as far away from other cars as possible, this estimation would work well. \n\nFor attendants, we can develop a mobile app and an API to report the numbers. Large, automated car parks can report their counts automatically via the API … \n\nGood idea. I guess I’ll throw in what I’ve got so far: \n\n- iClicker replacement: why do we have to buy them? Let’s build an app to do the same thing! I think it is a simple idea, yet there is a little bit of complexity to it. There are at least 2 target users - profs and students. There is an obvious usage to the mobile app. Web app can be used to both cast your vote and also to make questions, get results, etc. \n- Community translator app - allows you to request a translation of some text from people around the world. Rating based - kind of like Stack Overflow, but more like Airbnb :simple_smile: here, both mobile and web experience are pretty much identical, except that web gives you more functionality.","ts":"1452381373.000012"},{"type":"message","user":"U0J3A5RML","text":"I like the iClicker replacement.","ts":"1452438591.000002"},{"type":"message","user":"U0J3A5RML","text":"Another idea would be an RSS news reader","ts":"1452438615.000003"},{"type":"message","user":"U0HV1T7F1","text":"Parking app is a nice idea, however it is very data driven indeed.  Seems like it is leaning more towards mobile app then web imo","ts":"1452554639.000002"},{"type":"message","user":"U0J3D11K5","text":"Another idea is similar to what we talked about in HCI, some sort of home communication app. All the family members would join and be able to access each others calendars, a parent could assign a task to a child such as a specific chore or something. The child would get a notification and it would be added to a to do list until it was completed and the parents are notified.\nAnother use would be scheduling such as whose going to drive the kid to their game or who is going to be home to take the dog out at a specific time, whose going to cook supper that night etc. \nNot really sure how good this idea is but thought I'd throw it out there!","ts":"1452658126.000002"}]